Revit 2027 API
SpatialElementTag.IsTaggingLink Property
 Identifies if the tag has reference to a spatial element in a linked document or not.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public bool IsTaggingLink { get; }
Public ReadOnly Property IsTaggingLink As Boolean
	Get
public:
property bool IsTaggingLink {
	bool get ();
}
member IsTaggingLink : bool with get
Property Value
Boolean
See Also
Reference
SpatialElementTag Class
Autodesk.Revit.DB Namespace